; ModuleID = 'mptcp_server_kern.c'
source_filename = "mptcp_server_kern.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.ip6_hdr = type { %union.anon, %struct.in6_addr, %struct.in6_addr }
%union.anon = type { %struct.ip6_hdrctl }
%struct.ip6_hdrctl = type { i32, i16, i8, i8 }
%struct.in6_addr = type { %union.anon.0 }
%union.anon.0 = type { [4 x i32] }

@new_session = dso_local global %struct.bpf_map_def { i32 4, i32 4, i32 4, i32 1, i32 0 }, section "maps", align 4, !dbg !0
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !135
@llvm.used = appending global [3 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (i32 (%struct.xdp_md*)* @mptcp_server to i8*), i8* bitcast (%struct.bpf_map_def* @new_session to i8*)], section "llvm.metadata"

; Function Attrs: nounwind uwtable
define dso_local i32 @mptcp_server(%struct.xdp_md* nocapture readonly %0) #0 section "xdp" !dbg !159 {
  %2 = alloca i32, align 4
  call void @llvm.dbg.value(metadata %struct.xdp_md* %0, metadata !172, metadata !DIExpression()), !dbg !173
  call void @llvm.dbg.value(metadata %struct.xdp_md* %0, metadata !174, metadata !DIExpression()) #3, !dbg !180

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "new_session", scope: !2, file: !3, line: 13, type: !147, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !134, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "mptcp_server_kern.c", directory: "/home/hrntknr/work/go/src/github.com/hrntknr/mptcp-proxy/server")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3150, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !59, !62, !108, !130, !131}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !48, line: 163, size: 112, elements: !49)
!48 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!49 = !{!50, !55, !56}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !47, file: !48, line: 164, baseType: !51, size: 48)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, elements: !53)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !{!54}
!54 = !DISubrange(count: 6)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !47, file: !48, line: 165, baseType: !51, size: 48, offset: 48)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !47, file: !48, line: 166, baseType: !57, size: 16, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !58, line: 25, baseType: !59)
!58 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !60, line: 24, baseType: !61)
!60 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdr", file: !64, line: 24, size: 320, elements: !65)
!64 = !DIFile(filename: "/usr/include/netinet/ip6.h", directory: "")
!65 = !{!66, !85, !107}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_ctlun", scope: !63, file: !64, line: 37, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !63, file: !64, line: 26, size: 64, elements: !68)
!68 = !{!69, !84}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1", scope: !67, file: !64, line: 35, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_hdrctl", file: !64, line: 28, size: 64, elements: !71)
!71 = !{!72, !77, !80, !83}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_flow", scope: !70, file: !64, line: 30, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !74, line: 26, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !76, line: 42, baseType: !7)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_plen", scope: !70, file: !64, line: 32, baseType: !78, size: 16, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !74, line: 25, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !76, line: 40, baseType: !61)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_nxt", scope: !70, file: !64, line: 33, baseType: !81, size: 8, offset: 48)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !74, line: 24, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !76, line: 38, baseType: !52)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_hlim", scope: !70, file: !64, line: 34, baseType: !81, size: 8, offset: 56)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un2_vfc", scope: !67, file: !64, line: 36, baseType: !81, size: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_src", scope: !63, file: !64, line: 38, baseType: !86, size: 128, offset: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !87, line: 33, size: 128, elements: !88)
!87 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !86, file: !87, line: 40, baseType: !90, size: 128)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !86, file: !87, line: 34, size: 128, elements: !91)
!91 = !{!92, !97, !101}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !90, file: !87, line: 35, baseType: !93, size: 128)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !95)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !60, line: 21, baseType: !52)
!95 = !{!96}
!96 = !DISubrange(count: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !90, file: !87, line: 37, baseType: !98, size: 128)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !90, file: !87, line: 38, baseType: !102, size: 128)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !105)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !58, line: 27, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !60, line: 27, baseType: !7)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_dst", scope: !63, file: !64, line: 39, baseType: !86, size: 128, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !110, line: 25, size: 160, elements: !111)
!110 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !129}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !109, file: !110, line: 26, baseType: !57, size: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !109, file: !110, line: 27, baseType: !57, size: 16, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !109, file: !110, line: 28, baseType: !103, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !109, file: !110, line: 29, baseType: !103, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !109, file: !110, line: 31, baseType: !59, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !109, file: !110, line: 32, baseType: !59, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !109, file: !110, line: 33, baseType: !59, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !109, file: !110, line: 34, baseType: !59, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !109, file: !110, line: 35, baseType: !59, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !109, file: !110, line: 36, baseType: !59, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !109, file: !110, line: 37, baseType: !59, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !109, file: !110, line: 38, baseType: !59, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !109, file: !110, line: 39, baseType: !59, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !109, file: !110, line: 40, baseType: !59, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !109, file: !110, line: 55, baseType: !57, size: 16, offset: 112)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !109, file: !110, line: 56, baseType: !128, size: 16, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !58, line: 31, baseType: !59)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !109, file: !110, line: 57, baseType: !57, size: 16, offset: 144)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !60, line: 31, baseType: !133)
!133 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!134 = !{!0, !135, !139}
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 142, type: !137, isLocal: false, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 32, elements: !105)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !141, line: 162, type: !142, isLocal: true, isDefinition: true)
!141 = !DIFile(filename: "../libbpf/src/bpf_helper_defs.h", directory: "/home/hrntknr/work/go/src/github.com/hrntknr/mptcp-proxy/server")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!45, !145, !104, null}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !148, line: 57, size: 160, elements: !149)
!148 = !DIFile(filename: "../libbpf/src/bpf_helpers.h", directory: "/home/hrntknr/work/go/src/github.com/hrntknr/mptcp-proxy/server")
!149 = !{!150, !151, !152, !153, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !148, line: 58, baseType: !7, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !147, file: !148, line: 59, baseType: !7, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !147, file: !148, line: 60, baseType: !7, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !147, file: !148, line: 61, baseType: !7, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !147, file: !148, line: 62, baseType: !7, size: 32, offset: 128)
!155 = !{i32 7, !"Dwarf Version", i32 4}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{i32 1, !"wchar_size", i32 4}
!158 = !{!"clang version 10.0.0-4ubuntu1 "}
!159 = distinct !DISubprogram(name: "mptcp_server", scope: !3, file: !3, line: 137, type: !160, scopeLine: 138, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !171)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !163}
!162 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3161, size: 160, elements: !165)
!165 = !{!166, !167, !168, !169, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !6, line: 3162, baseType: !104, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !164, file: !6, line: 3163, baseType: !104, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !164, file: !6, line: 3164, baseType: !104, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !164, file: !6, line: 3166, baseType: !104, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !164, file: !6, line: 3167, baseType: !104, size: 32, offset: 128)
!171 = !{!172}
!172 = !DILocalVariable(name: "ctx", arg: 1, scope: !159, file: !3, line: 137, type: !163)
!173 = !DILocation(line: 0, scope: !159)
!174 = !DILocalVariable(name: "ctx", arg: 1, scope: !175, file: !3, line: 122, type: !163)
!175 = distinct !DISubprogram(name: "process_ethhdr", scope: !3, file: !3, line: 122, type: !160, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !176)
!176 = !{!174, !177, !178, !179}
!177 = !DILocalVariable(name: "data_end", scope: !175, file: !3, line: 124, type: !44)
!178 = !DILocalVariable(name: "data", scope: !175, file: !3, line: 125, type: !44)
!179 = !DILocalVariable(name: "eth", scope: !175, file: !3, line: 126, type: !46)
!180 = !DILocation(line: 0, scope: !175, inlinedAt: !181)
!181 = distinct !DILocation(line: 139, column: 12, scope: !159)
!182 = !DILocation(line: 124, column: 41, scope: !175, inlinedAt: !181)
!183 = !{!184, !185, i64 4}
!184 = !{!"xdp_md", !185, i64 0, !185, i64 4, !185, i64 8, !185, i64 12, !185, i64 16}
!185 = !{!"int", !186, i64 0}
!186 = !{!"omnipotent char", !187, i64 0}
!187 = !{!"Simple C/C++ TBAA"}
!188 = !DILocation(line: 124, column: 30, scope: !175, inlinedAt: !181)
!189 = !DILocation(line: 124, column: 22, scope: !175, inlinedAt: !181)
!190 = !DILocation(line: 125, column: 37, scope: !175, inlinedAt: !181)
!191 = !{!184, !185, i64 0}
!192 = !DILocation(line: 125, column: 26, scope: !175, inlinedAt: !181)
!193 = !DILocation(line: 126, column: 26, scope: !175, inlinedAt: !181)
!194 = !DILocation(line: 128, column: 5, scope: !195, inlinedAt: !181)
!195 = distinct !DILexicalBlock(scope: !175, file: !3, line: 128, column: 5)
!196 = !DILocation(line: 128, column: 5, scope: !175, inlinedAt: !181)
!197 = !DILocation(line: 130, column: 14, scope: !198, inlinedAt: !181)
!198 = distinct !DILexicalBlock(scope: !175, file: !3, line: 130, column: 9)
!199 = !{!200, !201, i64 12}
!200 = !{!"ethhdr", !186, i64 0, !186, i64 6, !201, i64 12}
!201 = !{!"short", !186, i64 0}
!202 = !DILocation(line: 130, column: 22, scope: !198, inlinedAt: !181)
!203 = !DILocation(line: 130, column: 9, scope: !175, inlinedAt: !181)
!204 = !DILocalVariable(name: "ctx", arg: 1, scope: !205, file: !3, line: 109, type: !163)
!205 = distinct !DISubprogram(name: "process_ip6ip6hdr", scope: !3, file: !3, line: 109, type: !206, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{!162, !163, !44, !46}
!208 = !{!204, !209, !210, !211, !212}
!209 = !DILocalVariable(name: "nxt_ptr", arg: 2, scope: !205, file: !3, line: 109, type: !44)
!210 = !DILocalVariable(name: "eth", arg: 3, scope: !205, file: !3, line: 109, type: !46)
!211 = !DILocalVariable(name: "data_end", scope: !205, file: !3, line: 111, type: !44)
!212 = !DILocalVariable(name: "ip6ip6", scope: !205, file: !3, line: 112, type: !62)
!213 = !DILocation(line: 0, scope: !205, inlinedAt: !214)
!214 = distinct !DILocation(line: 133, column: 12, scope: !175, inlinedAt: !181)
!215 = !DILocation(line: 114, column: 5, scope: !216, inlinedAt: !214)
!216 = distinct !DILexicalBlock(scope: !205, file: !3, line: 114, column: 5)
!217 = !DILocation(line: 114, column: 5, scope: !205, inlinedAt: !214)
!218 = !DILocation(line: 116, column: 35, scope: !219, inlinedAt: !214)
!219 = distinct !DILexicalBlock(scope: !205, file: !3, line: 116, column: 9)
!220 = !{!186, !186, i64 0}
!221 = !DILocation(line: 116, column: 47, scope: !219, inlinedAt: !214)
!222 = !DILocation(line: 116, column: 9, scope: !205, inlinedAt: !214)
!223 = !DILocalVariable(name: "ctx", arg: 1, scope: !224, file: !3, line: 96, type: !163)
